app/controllers/reports_controller.rb

INSERT INTO `reports` (`created_at`, `file`, `rep_id`, `updated_at`) VALUES ('2014-08-03 10:24:18', 'original.png', 'zl21', '2014-08-03 10:24:18')
---
	def create
		@report = Report.new(params[:report])
		@report.save!

SELECT `reports`.* FROM `reports` WHERE `reports`.`rep_id` = 'zl21' LIMIT 1
---
	def download
    	@report = Report.find_by_rep_id(params[:report][:rep_id])